In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100,
dtype='l'))

In [4]:
print(s1, s2, s3)

0     1
1     1
2     2
3     3
4     4
     ..
95    4
96    1
97    1
98    4
99    4
Length: 100, dtype: int32 0     2
1     2
2     2
3     3
4     2
     ..
95    1
96    1
97    2
98    3
99    2
Length: 100, dtype: int32 0     22142
1     21878
2     24499
3     20447
4     11085
      ...
95    28565
96    10386
97    11445
98    16916
99    17783
Length: 100, dtype: int32

In [7]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  1  2  22142
1  1  2  21878
2  2  2  24499
3  3  3  20447
4  4  2  11085

In [8]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2:
'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            22142
1      1       2            21878
2      2       2            24499
3      3       3            20447
4      4       2            11085

In [9]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)

In [10]:
bigcolumn = bigcolumn.to_frame()

In [12]:
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       1
1       1
2       2
3       3
4       4
..    ...
95  28565
96  10386
97  11445
98  16916
99  17783

[300 rows x 1 columns]

In [13]:
len(bigcolumn)

300

In [14]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        1
2        2
3        3
4        4
..     ...
295  28565
296  10386
297  11445
298  16916
299  17783

[300 rows x 1 columns]